app/controllers/school_classes_controller.rb

  def index
    @classes = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

  def create
    @class = SchoolClass.create(class_params)
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "fly me to the moon"], ["room_number", 5]]